In [6]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
import sqlalchemy
import psycopg2

In [2]:
engine = sqlalchemy.create_engine('postgresql://ugwplutjgjlhed:083afb2ff72e463187b46a1f383da288d9052b88ce5772cd9662e4c3d7f8b88c@ec2-54-163-34-107.compute-1.amazonaws.com:5432/de17tb83buchos')

In [3]:
%load_ext sql

In [4]:
%sql $engine.url

In [7]:
host = 'ec2-54-163-34-107.compute-1.amazonaws.com'
db = 'de17tb83buchos'
port = '5432'
user = 'ugwplutjgjlhed'
pwd = '083afb2ff72e463187b46a1f383da288d9052b88ce5772cd9662e4c3d7f8b88c'
conn = psycopg2.connect(user = user, password = pwd, host = host, port = port, database = db)

### Liệt kê các sản phẩm của nước Nhật theo mẫu sau, sắp tăng theo city

In [8]:
%%sql result1 <<
SELECT s.City, s.CompanyName, p.ProductName, p.UnitPrice
FROM suppliers s JOIN products p ON s.Id = p.SupplierId 
WHERE s.Country = 'Japan'
ORDER BY s.City ASC

 * postgresql://ugwplutjgjlhed:***@ec2-54-163-34-107.compute-1.amazonaws.com:5432/de17tb83buchos
6 rows affected.
Returning data to local variable result1

In [9]:
result1

[('Osaka', "Mayumi's", 'Konbu', Decimal('6.00')),
 ('Osaka', "Mayumi's", 'Tofu', Decimal('23.25')),
 ('Osaka', "Mayumi's", 'Genen Shouyu', Decimal('15.50')),
 ('Tokyo', 'Tokyo Traders', 'Mishi Kobe Niku', Decimal('97.00')),
 ('Tokyo', 'Tokyo Traders', 'Ikura', Decimal('31.00')),
 ('Tokyo', 'Tokyo Traders', 'Longlife Tofu', Decimal('10.00'))]

### 2. Thống kê theo quốc gia, cần tính đơn giá trung bình, đếm số sản phẩm, đếm số thành phố. Sắp tăng theo count_product

In [14]:
result = %sql SELECT * FROM products limit 5;
df = pd.DataFrame(result)
df.info()

 * postgresql://ugwplutjgjlhed:***@ec2-54-163-34-107.compute-1.amazonaws.com:5432/de17tb83buchos
5 rows affected.
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              5 non-null      int64
 1   productname     5 non-null      object
 2   supplierid      5 non-null      int64
 3   unitprice       5 non-null      object
 4   package         5 non-null      object
 5   isdiscontinued  5 non-null      object
dtypes: int64(2), object(4)
memory usage: 368.0+ bytes

In [15]:
%%sql result2 <<
SELECT s.Country, AVG(p.UnitPrice) AS AVG_UnitPrice, COUNT(p.Id) AS Count_Product, COUNT(s.City) AS Count_city
FROM suppliers s JOIN products p ON s.Id = p.SupplierId
WHERE p.IsDiscontinued = '0'
GROUP BY s.Country
ORDER BY COUNT(p.Id) ASC;

 * postgresql://ugwplutjgjlhed:***@ec2-54-163-34-107.compute-1.amazonaws.com:5432/de17tb83buchos
15 rows affected.
Returning data to local variable result2

In [16]:
result2

[('Spain', Decimal('29.5000000000000000'), 2, 2),
 ('Denmark', Decimal('10.7500000000000000'), 2, 2),
 ('Singapore', Decimal('32.7250000000000000'), 2, 2),
 ('Netherlands', Decimal('10.6666666666666667'), 3, 3),
 ('Sweden', Decimal('20.0000000000000000'), 3, 3),
 ('Finland', Decimal('18.0833333333333333'), 3, 3),
 ('Norway', Decimal('20.0000000000000000'), 3, 3),
 ('Canada', Decimal('27.3125000000000000'), 4, 4),
 ('France', Decimal('76.7500000000000000'), 5, 5),
 ('Italy', Decimal('27.3600000000000000'), 5, 5),
 ('Japan', Decimal('17.1500000000000000'), 5, 5),
 ('Australia', Decimal('33.1416666666666667'), 6, 6),
 ('Germany', Decimal('24.1457142857142857'), 7, 7),
 ('UK', Decimal('22.8142857142857143'), 7, 7),
 ('USA', Decimal('20.8272727272727273'), 11, 11)]

### 3. Liệt kê các đơn đặt hàng đặt trong tháng 3/2014 theo mẫu sau, sắp giảm dần theo  orderdate và totalAmount

In [17]:
%%sql result3 <<
SELECT CONCAT(c.FirstName,' ',c.LastName) AS CustomerName, o.OrderNumber, o.OrderDate, o.TotalAmount
FROM orders o JOIN customers c ON o.CustomerId = c.Id
WHERE OrderDate BETWEEN '2014-03-01' AND '2014-03-31' 
ORDER BY OrderDate DESC, TotalAmount DESC;

 * postgresql://ugwplutjgjlhed:***@ec2-54-163-34-107.compute-1.amazonaws.com:5432/de17tb83buchos
73 rows affected.
Returning data to local variable result3

In [18]:
result3

[('Paula Wilson', '543118', datetime.date(2014, 3, 31), Decimal('3772.00')),
 ('Ann Devon', '543117', datetime.date(2014, 3, 31), Decimal('2772.00')),
 ('Bernardo Batista', '543119', datetime.date(2014, 3, 31), Decimal('1353.60')),
 ('Patricia McKenna', '543115', datetime.date(2014, 3, 30), Decimal('2248.20')),
 ('Yvonne Moncada', '543116', datetime.date(2014, 3, 30), Decimal('2220.00')),
 ('Jose Pavarotti', '543114', datetime.date(2014, 3, 30), Decimal('1809.75')),
 ('Mario Pontes', '543111', datetime.date(2014, 3, 27), Decimal('15810.00')),
 ('Elizabeth Lincoln', '543112', datetime.date(2014, 3, 27), Decimal('1014.00')),
 ('Jose Pavarotti', '543113', datetime.date(2014, 3, 27), Decimal('796.50')),
 ('Maria Larsson', '543110', datetime.date(2014, 3, 27), Decimal('310.00')),
 ('Roland Mendel', '543109', datetime.date(2014, 3, 26), Decimal('4813.50')),
 ('Maria Larsson', '543107', datetime.date(2014, 3, 26), Decimal('2233.00')),
 ('Catherine Dewey', '543108', datetime.date(2014, 3, 26), Decimal('1500.70')),
 ('Carlos Hernández', '543106', datetime.date(2014, 3, 25), Decimal('912.00')),
 ('Elizabeth Lincoln', '543105', datetime.date(2014, 3, 25), Decimal('717.50')),
 ('Art Braunschweiger', '543104', datetime.date(2014, 3, 25), Decimal('439.00')),
 ('Carine Schmitt', '543101', datetime.date(2014, 3, 24), Decimal('1733.06')),
 ('Daniel Tonini', '543103', datetime.date(2014, 3, 24), Decimal('291.55')),
 ('Martín Sommer', '543100', datetime.date(2014, 3, 24), Decimal('280.00')),
 ('Daniel Tonini', '543102', datetime.date(2014, 3, 24), Decimal('251.50')),
 ('Roland Mendel', '543098', datetime.date(2014, 3, 23), Decimal('1408.00')),
 ('Karin Josephs', '543097', datetime.date(2014, 3, 23), Decimal('910.40')),
 ('Pedro Afonso', '543099', datetime.date(2014, 3, 23), Decimal('108.00')),
 ('Dominique Perrier', '543094', datetime.date(2014, 3, 20), Decimal('2052.50')),
 ('Yang Wang', '543096', datetime.date(2014, 3, 20), Decimal('1255.60')),
 ('Rene Phillips', '543095', datetime.date(2014, 3, 20), Decimal('848.00')),
 ('Horst Kloss', '543092', datetime.date(2014, 3, 19), Decimal('3584.00')),
 ('Lúcia Carvalho', '543091', datetime.date(2014, 3, 19), Decimal('1122.00')),
 ('Carlos Hernández', '543090', datetime.date(2014, 3, 19), Decimal('276.60')),
 ('Lino Rodriguez', '543093', datetime.date(2014, 3, 19), Decimal('68.00')),
 ('Carlos Hernández', '543087', datetime.date(2014, 3, 18), Decimal('1762.70')),
 ('Yvonne Moncada', '543088', datetime.date(2014, 3, 18), Decimal('781.00')),
 ('André Fonseca', '543089', datetime.date(2014, 3, 18), Decimal('155.00')),
 ('Felipe Izquierdo', '543084', datetime.date(2014, 3, 17), Decimal('1902.10')),
 ('Hanna Moos', '543086', datetime.date(2014, 3, 17), Decimal('677.00')),
 ('Maria Larsson', '543085', datetime.date(2014, 3, 17), Decimal('93.00')),
 ('Thomas Hardy', '543083', datetime.date(2014, 3, 16), Decimal('4675.00')),
 ('Maria Anders', '543082', datetime.date(2014, 3, 16), Decimal('491.20')),
 ('Michael Holz', '543081', datetime.date(2014, 3, 16), Decimal('482.90')),
 ('Giovanni Rovelli', '543080', datetime.date(2014, 3, 16), Decimal('110.00')),
 ('Elizabeth Lincoln', '543079', datetime.date(2014, 3, 13), Decimal('4422.00')),
 ('José Pedro Freyre', '543078', datetime.date(2014, 3, 13), Decimal('2362.25')),
 ('Victoria Ashworth', '543077', datetime.date(2014, 3, 13), Decimal('220.00')),
 ('Palle Ibsen', '543076', datetime.date(2014, 3, 12), Decimal('1407.50')),
 ('Elizabeth Lincoln', '543074', datetime.date(2014, 3, 12), Decimal('1139.10')),
 ('Alexander Feuer', '543075', datetime.date(2014, 3, 12), Decimal('245.00')),
 ('Jose Pavarotti', '543071', datetime.date(2014, 3, 11), Decimal('4769.00')),
 ('Victoria Ashworth', '543073', datetime.date(2014, 3, 11), Decimal('711.00')),
 ('Maurizio Moroni', '543072', datetime.date(2014, 3, 11), Decimal('560.00')),
 ('Laurence Lebihan', '543070', datetime.date(2014, 3, 11), Decimal('360.00')),
 ('Horst Kloss', '543068', datetime.date(2014, 3, 10), Decimal('3642.50')),
 ('Giovanni Rovelli', '543069', datetime.date(2014, 3, 10), Decimal('750.00')),
 ('Patricio Simpson', '543067', datetime.date(2014, 3, 10), Decimal('644.80')),
 ('Paula Parente', '543065', datetime.date(2014, 3, 9), Decimal('700.00')),
 ('Howard Snyder', '543066', datetime.date(2014, 3, 9), Decimal('570.00')),
 ('Renate Messner', '543064', datetime.date(2014, 3, 9), Decimal('500.00')),
 ('Pascale Cartrain', '543060', datetime.date(2014, 3, 6), Decimal('2455.00')),
 ('Laurence Lebihan', '543062', datetime.date(2014, 3, 6), Decimal('1925.50')),
 ('Helen Bennett', '543063', datetime.date(2014, 3, 6), Decimal('920.60')),
 ('Michael Holz', '543061', datetime.date(2014, 3, 6), Decimal('837.00')),
 ('Peter Franken', '543059', datetime.date(2014, 3, 5), Decimal('1174.75')),
 ('Daniel Tonini', '543057', datetime.date(2014, 3, 5), Decimal('800.00')),
 ('Eduardo Saavedra', '543058', datetime.date(2014, 3, 5), Decimal('137.50')),
 ('Christina Berglund', '543054', datetime.date(2014, 3, 4), Decimal('2034.50')),
 ('Mario Pontes', '543055', datetime.date(2014, 3, 4), Decimal('559.00')),
 ('Ana Trujillo', '543056', datetime.date(2014, 3, 4), Decimal('514.40')),
 ('Palle Ibsen', '543051', datetime.date(2014, 3, 3), Decimal('1936.00')),
 ('Annette Roulet', '543053', datetime.date(2014, 3, 3), Decimal('936.00')),
 ('Mario Pontes', '543052', datetime.date(2014, 3, 3), Decimal('742.50')),
 ('Thomas Hardy', '543050', datetime.date(2014, 3, 3), Decimal('390.00')),
 ('Elizabeth Lincoln', '543048', datetime.date(2014, 3, 2), Decimal('1930.00')),
 ('Felipe Izquierdo', '543049', datetime.date(2014, 3, 2), Decimal('1122.80')),
 ('Alejandra Camino', '543047', datetime.date(2014, 3, 2), Decimal('365.89'))]

### 4. Cho biết theo mỗi năm với 5 sản phẩm có tổng thành tiền lớn nhất

In [25]:
%%sql result4 <<
WITH q AS
(
SELECT DENSE_RANK() OVER(PARTITION BY p.ProductName, YEAR(o.OrderDate) ORDER BY o.TotalAmount DESC) AS HANG,
    OrderDate, TotalAmount, ProductName 
FROM orders o JOIN orderitems oi ON o.Id = oi.OrderId JOIN products p ON p.Id = oi.ProductId
)
SELECT YEAR(OrderDate),q.ProductName, q.TotalAmount FROM q WHERE HANG <= 5 GROUP BY YEAR(q.OrderDate),q.ProductName;

 * postgresql://ugwplutjgjlhed:***@ec2-54-163-34-107.compute-1.amazonaws.com:5432/de17tb83buchos
(psycopg2.errors.UndefinedFunction) function year(date) does not exist
LINE 3: ...ECT DENSE_RANK() OVER(PARTITION BY p.ProductName, YEAR(o.Ord...
                                                             ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: WITH q AS
(
SELECT DENSE_RANK() OVER(PARTITION BY p.ProductName, YEAR(o.OrderDate) ORDER BY o.TotalAmount DESC) AS HANG,
    OrderDate, TotalAmount, ProductName
FROM orders o JOIN orderitems oi ON o.Id = oi.OrderId JOIN products p ON p.Id = oi.ProductId
)
SELECT YEAR(OrderDate),q.ProductName, q.TotalAmount FROM q WHERE HANG <= 5 GROUP BY YEAR(q.OrderDate),q.ProductName;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [ ]:
result4

### # 5. Liệt kê các đơn đặt hàng theo mẫu sau và có ngày đặt hàng là ngày chủ nhật của tháng 3/2014, sắp giảm theo orderdate

In [ ]:
%%sql result5 <<
SELECT o.OrderNumber, o.OrderDate, CONCAT(c.FirstName,' ',c.LastName) AS "CustomerName", o.TotalAmount
FROM orders o JOIN customers c ON o.CustomerId = c.Id
WHERE WEEKDAY(OrderDate) = 6 AND (OrderDate BETWEEN '2014-03-01' AND '2014-03-31')
ORDER BY OrderDate DESC

In [ ]:
result5

### # 6. Liệt kê các customer theo mẫu sau và đếm các đơn đặt hàng của các customer, chỉ in các customer nào có đếm>15, sắp giảm theo đếm

In [ ]:
%%sql result6 <<
SELECT CONCAT(c.FirstName,' ',c.LastName) AS 'CustomerName', c.Country, c.City, q.count_order
FROM customers c JOIN
(
    SELECT CustomerId, COUNT(Id) AS count_order
    FROM orders
    GROUP BY CustomerId
) q ON c.Id = q.CustomerId
WHERE q.count_order > 15
ORDER BY q.count_order DESC
    ;

In [ ]:
result6

### 7. Cho biết 2 quý nào có tổng thành tiền bán cao nhất

In [ ]:
%%sql result7 <<
SELECT DISTINCT year(OrderDate) AS Sale_year, quarter(orderdate) AS Quarter,
SUM(TotalAmount) OVER(PARTITION BY year(OrderDate), quarter(OrderDate)) AS sum_totalamount
FROM orders;

In [ ]:
result7

Cach khac: SELECT DISTINCT year(OrderDate) as nam, quarter(orderdate) as quy, 
( 
    SELECT  SUM(TotalAmount) from orders 
    WHERE year(OrderDate) = year(o.OrderDate) AND quarter(OrderDate) = quarter(o.OrderDate)
    ) as sum_totalamount
FROM orders o
GROUP BY year(OrderDate), quarter(orderdate)
ORDER BY sum_totalamount DESC
limit 2

### 8. Liệt kê tất cả khách hàng và đếm số đơn đặt hàng, sắp tăng theo count_orders

In [ ]:
%%sql result8 <<
SELECT CONCAT(c.FirstName,' ',c.LastName) AS 'CustomerName', COUNT(IFNULL(o.Id,0)) AS count_orders
FROM orders o JOIN customers c ON o.CustomerId = c.Id
GROUP BY CustomerName
ORDER BY count_orders

In [ ]:
result8

### 9. Liệt kê theo mẫu sau gồm 10 đơn đặt hàng có đặt product tên là Chai, sắp giảm theo totalamount

In [ ]:
%%sql result9 <<
SELECT *
FROM orders 
WHERE Id IN (SELECT orderid FROM orderitems 
                   WHERE productid IN (SELECT id FROM products WHERE ProductName ='Chai'))
                   ORDER BY TotalAmount DESC
LIMIT 10;

In [ ]:
result9

### 10. Hãy giải thích ý nghĩa của câu truy vấn trên. Thay thế NULL của cột sum_quantity thành giá trị 0

Ý nghĩa câu truy vấn: 
Liệt kê danh sách các sản phẩm còn đang được kinh doanh và tổng số lượng đặt, kể cả các sản phẩm chưa có đơn đặt hàng nào. Thống kê theo tên sản phẩm và sắp xếp theo tổng số lượng đặt (sum_quantity)

%%sql result10 <<
SELECT p.ProductName, SUM(i.Quantity) AS sum_quantity
FROM products p LEFT JOIN orderitems i ON p.Id=i.ProductId LEFT JOIN orders o ON o.Id= i.OrderId
WHERE p.IsDiscontinued = 0
GROUP BY p.ProductName
ORDER BY sum_quantity;

In [ ]:
%%sql result10 <<
SELECT p.ProductName, 
    CASE 
        WHEN SUM(i.Quantity) IS NOT NULL THEN SUM(i.Quantity) 
        ELSE 0
    END AS sum_quantity
FROM products p LEFT JOIN orderitems i ON p.Id=i.ProductId LEFT JOIN orders o ON o.Id= i.OrderId
WHERE p.IsDiscontinued = 0
GROUP BY p.ProductName
ORDER BY sum_quantity;

In [ ]:
result10

### Câu 2: Trực quan hóa dữ liệu (1 điểm)
1. Vẽ biểu đồ bar như sau, gồm 10 customer có nhiều đơn đặt hàng nhất

In [ ]:
%%sql result21 <<
SELECT CONCAT(c.FirstName,' ',c.LastName) AS 'CustomerName', COUNT(IFNULL(o.Id,0)) AS count_orders
FROM orders o JOIN customers c ON o.CustomerId = c.Id
GROUP BY CustomerName
ORDER BY count_orders desc
LIMIT 10

In [ ]:
df= result21.DataFrame()

In [ ]:
print(df)

In [ ]:
sns.set_theme(style="darkgrid")

plt.figure(figsize=(10,6))

sns.barplot(x="count_orders", y="CustomerName", data=df)
plt.xlabel('count orders')
plt.ylabel('Customer Name')
plt.show()

### 2. Vẽ 2 biểu đồ bar (trong cùng một figure) tương ứng với các năm 2012, 2013

In [ ]:
%%sql result2012 <<
SELECT CONCAT(c.FirstName,' ',c.LastName) AS 'CustomerName', COUNT(*) AS count_orders, YEAR(OrderDate)
FROM orders o JOIN customers c ON o.CustomerId = c.Id
WHERE YEAR(OrderDate) = 2012
GROUP BY CustomerName
ORDER BY count_orders desc
LIMIT 5

In [ ]:
df_2012 = result2012.DataFrame()
print(df_2012)

In [ ]:
%%sql result2013 <<
SELECT CONCAT(c.FirstName,' ',c.LastName) AS 'CustomerName', COUNT(*) AS count_orders, YEAR(OrderDate)
FROM orders o JOIN customers c ON o.CustomerId = c.Id
WHERE YEAR(OrderDate) = 2013
GROUP BY CustomerName
ORDER BY count_orders desc
LIMIT 5

In [ ]:
df_2013 = result2013.DataFrame()
print(df_2013)

In [ ]:
df_f = pd.concat([df_2012, df_2013])
print(df_f)

In [ ]:
plt.figure(figsize=(8,6))
sns.catplot(data=df_f, x='CustomerName', y='count_orders', kind='bar', row='YEAR(OrderDate)')
plt.show()
plt.clf()

In [ ]:

sns.catplot(data=df_2012, x='CustomerName', y='count_orders', kind='bar', row='YEAR(OrderDate)')
plt.xticks(rotation = 45)
plt.show()


sns.catplot(data=df_2013, x='CustomerName', y='count_orders', kind='bar', row='YEAR(OrderDate)')
plt.xticks(rotation = 45)
plt.show()